dariocastillo11/SNAKE---LPC1769/src/triangular_signal_melodias.c
#include "LPC17xx.h"
#include "lpc17xx_timer.h"
#include "lpc17xx_gpio.h"
#include "lpc17xx_pinsel.h"
#include "lpc17xx_dac.h"

#define SALIDA          (uint8_t) 1
#define ENTRADA         (uint8_t) 0

#define PIN_22          ((uint32_t)(1<<22))

#define PORT_CERO       (uint8_t) 0
#define PORT_UNO        (uint8_t) 1
#define PORT_DOS        (uint8_t) 2
#define PORT_TRES       (uint8_t) 3

/* ========================== DEFINICIONES DE NOTAS ========================= */

// Frecuencias de notas musicales (en Hz) - Escala temperada
#define DO_3    131
#define DO_S3   139
#define RE_3    147
#define RE_S3   156
#define MI_3    165
#define FA_3    175
#define FA_S3   185
#define SOL_3   196
#define SOL_S3  208
#define LA_3    220
#define LA_S3   233
#define SI_3    247

#define DO_4    262
#define DO_S4   277
#define RE_4    294
#define RE_S4   311
#define MI_4    330
#define FA_4    349
#define FA_S4   370
#define SOL_4   392
#define SOL_S4  415
#define LA_4    440
#define LA_S4   466
#define SI_4    494

#define DO_5    523
#define DO_S5   554
#define RE_5    587
#define RE_S5   622
#define MI_5    659
#define FA_5    698
#define FA_S5   740
#define SOL_5   784
#define SOL_S5  831
#define LA_5    880
#define LA_S5   932
#define SI_5    988

#define SILENCIO 0

// Duraciones de notas (en milisegundos)
#define REDONDA      2000
#define BLANCA       1000
#define NEGRA        500
#define CORCHEA      250
#define SEMICORCHEA  125

/* ========================== ESTRUCTURA DE NOTA ============================ */

typedef struct {
    uint16_t frecuencia;
    uint16_t duracion;
} Nota;

/* ============================= MELODÍAS ===================================== */

// Melodía 1: "Happy Birthday"
const Nota melodia_happy_birthday[] = {
    {DO_4, NEGRA}, {DO_4, CORCHEA}, {RE_4, BLANCA},
    {DO_4, BLANCA}, {FA_4, BLANCA}, {MI_4, REDONDA},
    {DO_4, NEGRA}, {DO_4, CORCHEA}, {RE_4, BLANCA},
    {DO_4, BLANCA}, {SOL_4, BLANCA}, {FA_4, REDONDA},
    {DO_4, NEGRA}, {DO_4, CORCHEA}, {DO_5, BLANCA},
    {LA_4, BLANCA}, {FA_4, BLANCA}, {MI_4, BLANCA}, {RE_4, BLANCA},
    {SI_4, NEGRA}, {SI_4, CORCHEA}, {LA_4, BLANCA},
    {FA_4, BLANCA}, {SOL_4, BLANCA}, {FA_4, REDONDA},
    {SILENCIO, 0}
};

// Melodía 2: "Super Mario Bros Theme"
const Nota melodia_mario[] = {
    {MI_5, CORCHEA}, {MI_5, CORCHEA}, {SILENCIO, CORCHEA}, {MI_5, CORCHEA},
    {SILENCIO, CORCHEA}, {DO_5, CORCHEA}, {MI_5, CORCHEA}, {SILENCIO, CORCHEA},
    {SOL_5, NEGRA}, {SILENCIO, NEGRA}, {SOL_4, NEGRA}, {SILENCIO, NEGRA},
    {DO_5, CORCHEA+SEMICORCHEA}, {SILENCIO, SEMICORCHEA}, {SOL_4, CORCHEA+SEMICORCHEA},
    {SILENCIO, SEMICORCHEA}, {MI_4, CORCHEA+SEMICORCHEA}, {SILENCIO, SEMICORCHEA},
    {LA_4, CORCHEA}, {SILENCIO, CORCHEA}, {SI_4, CORCHEA}, {SILENCIO, CORCHEA},
    {LA_S4, CORCHEA}, {LA_4, CORCHEA},
    {SILENCIO, 0}
};

// Melodía 3: "Tetris Theme"
const Nota melodia_tetris[] = {
    {MI_4, NEGRA}, {SI_3, CORCHEA}, {DO_4, CORCHEA}, {RE_4, NEGRA},
    {DO_4, CORCHEA}, {SI_3, CORCHEA}, {LA_3, NEGRA}, {LA_3, CORCHEA},
    {DO_4, CORCHEA}, {MI_4, NEGRA}, {RE_4, CORCHEA}, {DO_4, CORCHEA},
    {SI_3, NEGRA+CORCHEA}, {DO_4, CORCHEA}, {RE_4, NEGRA}, {MI_4, NEGRA},
    {DO_4, NEGRA}, {LA_3, NEGRA}, {LA_3, NEGRA}, {SILENCIO, CORCHEA},
    {SILENCIO, 0}
};

// Melodía 4: "Nokia Tune"
const Nota melodia_nokia[] = {
    {MI_5, CORCHEA}, {RE_5, CORCHEA}, {FA_S4, NEGRA}, {SOL_S4, NEGRA},
    {DO_S5, CORCHEA}, {SI_4, CORCHEA}, {RE_4, NEGRA}, {MI_4, NEGRA},
    {SI_4, CORCHEA}, {LA_4, CORCHEA}, {DO_S4, NEGRA}, {MI_4, NEGRA},
    {LA_4, BLANCA},
    {SILENCIO, 0}
};

/* ==================== CONFIGURACIÓN DE GENERACIÓN DE AUDIO ================ */

// Número de puntos en la tabla de onda (más muestras = mayor calidad)
#define NUMERO_MUESTRAS    64

// Valor máximo del DAC de 10 bits (2^10 - 1 = 1023)
#define MAXIMO_VALOR_DAC   1023

// Conversión de tiempo
#define MICROSEGUNDOS_POR_SEGUNDO  1000000  // 1 segundo = 1,000,000 microsegundos

// Configuración de pausas entre notas
#define PAUSA_ARTICULACION_MS      30       // Pausa de 30ms entre notas para claridad
#define PAUSA_ENTRE_MELODIAS_MS    3000     // Pausa de 3 segundos entre melodías

// Configuración del LED de actividad
#define LED_TOGGLE_INTERRUPCIONES  500      // Toggle LED cada 500 interrupciones

// Tabla de onda triangular (64 muestras para mejor rendimiento)
const uint16_t TABLA_TRIANGULAR[NUMERO_MUESTRAS] = {
    0,    32,   64,   96,   128,  160,  192,  224,  256,  288,  320,  352,  384,  416,  448,  480,
    512,  544,  576,  608,  640,  672,  704,  736,  768,  800,  832,  864,  896,  928,  960,  992,
    1023, 992,  960,  928,  896,  864,  832,  800,  768,  736,  704,  672,  640,  608,  576,  544,
    512,  480,  448,  416,  384,  352,  320,  288,  256,  224,  192,  160,  128,  96,   64,   32
};

/* ========================== VARIABLES GLOBALES ============================ */

/* ─────────────────────────────────────────────────────────────────────────
 * VARIABLES DE GENERACIÓN DE AUDIO (usadas por el IRQHandler)
 * ───────────────────────────────────────────────────────────────────────── */

// Índice actual en TABLA_TRIANGULAR (0-63)
volatile uint8_t INDICE_TABLA_DE_ONDA = 0;

// Duración restante de la nota (legacy - no se usa actualmente)
volatile uint32_t nota_duracion_ms = 0;

// Frecuencia que se está reproduciendo actualmente (en Hz)
volatile uint16_t frecuencia_actual = 0;

// Flag que controla si el DAC genera audio o está en silencio
// - 1: El IRQHandler escribe valores de TABLA_TRIANGULAR al DAC
// - 0: El IRQHandler NO escribe al DAC (silencio)
// CAMBIA EN: set_frecuencia()
volatile uint8_t reproduciendo = 0;

// Contador de tiempo global (incrementado cada 1ms por Match 1)
volatile uint32_t tiempo_transcurrido_ms = 0;

/* ─────────────────────────────────────────────────────────────────────────
 * VARIABLES DE CONTROL DE MELODÍA (usadas por el main loop)
 * ───────────────────────────────────────────────────────────────────────── */

// Puntero a la melodía que se está reproduciendo
// - NULL: No hay melodía activa
// - !NULL: Hay una melodía en curso
// CAMBIA EN: iniciar_melodia() (se asigna), detener_melodia() y actualizar_melodia() (se pone NULL)
const Nota *melodia_actual = NULL;

