dariocastillo11/SNAKE---LPC1769/src/triangular_signal_melodias.c
// Índice de la nota actual dentro de melodia_actual[]
volatile uint16_t indice_nota_actual = 0;

// Timestamp en que comenzó la nota actual (para calcular duración)
volatile uint32_t tiempo_inicio_nota = 0;

/* ========================== DECLARACIONES DE FUNCIONES ==================== */

void config_GPIO(void);
void config_timer(void);
void config_DAC(void);
void set_frecuencia(uint16_t frecuencia_hz);
void iniciar_melodia(const Nota *melodia);
void detener_melodia(void);
void actualizar_melodia(void);  // Función no bloqueante para avanzar melodía
uint8_t esta_reproduciendo(void);
uint32_t obtener_tiempo_ms(void);  // Obtener tiempo global

/* ===================== MANEJADOR DE INTERRUPCIONES ======================= */

/**
 * @brief Manejador de interrupción del Timer0
 * 
 * Este handler maneja DOS interrupciones diferentes del mismo timer:
 * 
 * Match 0 (Generación de audio):
 *   - Interrumpe a velocidad variable (según la nota musical)
 *   - Lee un valor de TABLA_TRIANGULAR[] y lo envía al DAC
 *   - Avanza al siguiente punto de la tabla
 *   - Genera la forma de onda triangular
 * 
 * Match 1 (Base de tiempo):
 *   - Interrumpe cada 1 milisegundo (fijo)
 *   - Incrementa contador de tiempo global
 *   - Sirve para medir duraciones de notas
 *   - Útil para el timing del juego
 * 
 * Ejemplo: Para tocar DO_4 (262Hz):
 *   Match 0: interrumpe cada ~60μs (genera onda)
 *   Match 1: interrumpe cada 1ms (mide duración)
 */
void TIMER0_IRQHandler(void){
    /* ─────────────────────────────────────────────────────────────────────
     * Match 0: GENERACIÓN DE FORMA DE ONDA (velocidad variable)
     * ───────────────────────────────────────────────────────────────────── */
    if(TIM_GetIntStatus(LPC_TIM0, TIM_MR0_INT)) {
        TIM_ClearIntPending(LPC_TIM0, TIM_MR0_INT);

        // Solo genera onda si hay una nota activa
        if (reproduciendo) {
            // 1. Leer el valor actual de la tabla de onda triangular
            uint16_t valor_dac = TABLA_TRIANGULAR[INDICE_TABLA_DE_ONDA];
            
            // 2. Enviar ese valor al DAC (pin P0.26)
            DAC_UpdateValue(valor_dac);

            // 3. Avanzar al siguiente punto de la tabla
            INDICE_TABLA_DE_ONDA++;
            
            // 4. Si llegamos al final, volver al inicio (ciclo continuo)
            if(INDICE_TABLA_DE_ONDA >= NUMERO_MUESTRAS) {
                INDICE_TABLA_DE_ONDA = 0;
            }
            
            // 5. Programar el próximo match (contador corre libre)
            // Calcular el período entre muestras según la frecuencia actual
            uint32_t periodo_completo_us = MICROSEGUNDOS_POR_SEGUNDO / frecuencia_actual;
            uint32_t tiempo_entre_muestras = periodo_completo_us / NUMERO_MUESTRAS;
            
            // Sumar el intervalo al match actual para obtener el próximo
            uint32_t proximo_match = LPC_TIM0->MR0 + tiempo_entre_muestras;
            TIM_UpdateMatchValue(LPC_TIM0, TIM_MATCH_0, proximo_match);
        }

        // Indicador visual de actividad (LED parpadea)
        static uint16_t led_counter = 0;
        led_counter++;
        
        if(led_counter >= LED_TOGGLE_INTERRUPCIONES) {
            led_counter = 0;
            
            // Toggle del LED en P0.22
            if(GPIO_ReadValue(PORT_CERO) & PIN_22) {
                GPIO_ClearPins(PORT_CERO, PIN_22);
            } else {
                GPIO_SetPins(PORT_CERO, PIN_22);
            }
        }
    }
    
    /* ─────────────────────────────────────────────────────────────────────
     * Match 1: CONTADOR DE TIEMPO (1ms fijo)
     * ───────────────────────────────────────────────────────────────────── */
    if(TIM_GetIntStatus(LPC_TIM0, TIM_MR1_INT)) {
        TIM_ClearIntPending(LPC_TIM0, TIM_MR1_INT);
        
        // Incrementar contador global de milisegundos (para el juego y melodías)
        tiempo_transcurrido_ms++;
        
        // Decrementar contador auxiliar (compatible con versiones anteriores)
        if (nota_duracion_ms > 0) {
            nota_duracion_ms--;
        }
        
        // Programar el próximo match 1ms adelante (contador corre libre)
        #define MICROSEGUNDOS_POR_MS  1000
        uint32_t proximo_match = LPC_TIM0->MR1 + MICROSEGUNDOS_POR_MS;
        TIM_UpdateMatchValue(LPC_TIM0, TIM_MATCH_1, proximo_match);
    }
    
    return;
}

/* ======================= FUNCIONES DE UTILIDAD ============================ */

/**
 * @brief Obtiene el tiempo transcurrido desde el inicio en milisegundos
 * @return Tiempo en milisegundos
 * @note Útil para el loop del juego
 */
uint32_t obtener_tiempo_ms(void) {
    return tiempo_transcurrido_ms;
}

/**
 * @brief Verifica si hay una melodía activa en reproducción
 * 
 * Esta función verifica si HAY UNA MELODÍA EN CURSO, no si está sonando
 * en este instante preciso. Una melodía puede estar activa pero en silencio
 * momentáneo (pausas entre notas, notas de silencio, etc.).
 * 
 * Diferencia entre las banderas:
 * 
 *   melodia_actual (puntero):
 *     - NULL: No hay melodía en curso
 *     - !NULL: Hay una melodía activa (puede estar en pausa/silencio)
 *     - Se actualiza en: iniciar_melodia(), detener_melodia(), actualizar_melodia()
 * 
 *   reproduciendo (flag):
 *     - 0: DAC no está generando audio (silencio)
 *     - 1: DAC está generando audio activamente
 *     - Se actualiza en: set_frecuencia()
 *     - Puede cambiar múltiples veces durante una melodía
 * 
 * Ejemplo de estados durante reproducción:
 *   t=0ms:    melodia_actual=melodia_mario, reproduciendo=1  (DO_4 sonando)
 *   t=500ms:  melodia_actual=melodia_mario, reproduciendo=0  (pausa articulación)
 *   t=530ms:  melodia_actual=melodia_mario, reproduciendo=1  (MI_4 sonando)
 *   t=10000ms: melodia_actual=NULL, reproduciendo=0          (melodía terminó)
 * 
 * @return 1 si hay una melodía activa (aunque esté en silencio momentáneo)
 *         0 si no hay ninguna melodía en curso
 * 
 * @note Esta función verifica melodia_actual, NO reproduciendo
 */
uint8_t esta_reproduciendo(void) {
    return (melodia_actual != NULL);
}

/**
 * @brief Configura la frecuencia de reproducción para una nota musical
 * 
 * Esta función calcula la velocidad a la que Match 0 debe interrumpir para
 * generar la frecuencia deseada. NO genera la onda directamente, solo configura
 * qué tan rápido el TIMER0_IRQHandler debe leer la TABLA_TRIANGULAR.
 * 
 * Proceso:
 * 1. Calcula el período de UN ciclo completo de la nota (en microsegundos)
 * 2. Divide ese período entre 64 muestras
 * 3. Configura Match 0 para interrumpir en ese intervalo
 * 4. El handler lee la tabla y genera la onda
 * 
 * Ejemplo para DO_4 (262 Hz):
 *   - Período = 1,000,000 / 262 = 3,816 μs (un ciclo completo)
 *   - Match 0 = 3,816 / 64 = 60 μs (tiempo entre muestras)
 *   - Resultado: 64 muestras × 60μs = 3,840μs ≈ 262 Hz ✓
 * 
 * @param frecuencia_hz Frecuencia deseada en Hertz (0 = silencio)
 * 
 * @note El Timer0 SIEMPRE está corriendo, solo cambia el flag 'reproduciendo'
 *       para activar/desactivar la escritura al DAC
 */
void set_frecuencia(uint16_t frecuencia_hz) {
    // Caso especial: Silencio
    if (frecuencia_hz == 0 || frecuencia_hz == SILENCIO) {
        reproduciendo = 0;              // Desactivar generación de onda
        DAC_UpdateValue(0);             // DAC a 0V
        frecuencia_actual = 0;
        INDICE_TABLA_DE_ONDA = 0;
        return;
    }
    
