dariocastillo11/SNAKE---LPC1769/src/triangular_signal_melodias.c
    /* ─────────────────────────────────────────────────────────────────────
     * CÁLCULO DE PERÍODO DE MUESTREO
     * ───────────────────────────────────────────────────────────────────── */
    
    // 1. Período de UN CICLO completo de la nota (en microsegundos)
    //    Período = 1 / Frecuencia
    //    En μs:   (1,000,000 μs/s) / Frecuencia(Hz)
    uint32_t periodo_completo_us = MICROSEGUNDOS_POR_SEGUNDO / frecuencia_hz;
    
    // 2. Tiempo entre cada muestra de la tabla
    //    Dividimos el período completo entre las 64 muestras
    uint32_t tiempo_entre_muestras_us = periodo_completo_us / NUMERO_MUESTRAS;
    
    /* ─────────────────────────────────────────────────────────────────────
     * CONFIGURACIÓN DEL TIMER
     * ───────────────────────────────────────────────────────────────────── */
    
    // IMPORTANTE: Como el contador corre libre (no se resetea), debemos
    // configurar el próximo match sumando el intervalo al valor actual del timer
    uint32_t contador_actual = LPC_TIM0->TC;
    uint32_t proximo_match = contador_actual + tiempo_entre_muestras_us;
    
    TIM_UpdateMatchValue(LPC_TIM0, TIM_MATCH_0, proximo_match);
    
    // Reiniciar índice de la tabla (empezar desde el principio)
    INDICE_TABLA_DE_ONDA = 0;
    
    // Guardar frecuencia actual y activar reproducción
    frecuencia_actual = frecuencia_hz;
    reproduciendo = 1;
}

/**
 * @brief Inicia la reproducción de una melodía de forma no bloqueante
 * 
 * Esta función prepara todo para comenzar a tocar una melodía, pero NO espera
 * a que termine. El avance de la melodía se maneja con actualizar_melodia()
 * que debe llamarse repetidamente desde el loop principal.
 * 
 * Proceso:
 * 1. Guarda el puntero a la melodía
 * 2. Reinicia el índice a la primera nota
 * 3. Marca el tiempo de inicio
 * 4. Configura y empieza a tocar la primera nota
 * 
 * Estado de banderas después de llamar esta función:
 *   melodia_actual = [puntero a la melodía]  (ya NO es NULL)
 *   reproduciendo = 1                         (set_frecuencia() lo activa)
 *   indice_nota_actual = 0                    (primera nota)
 * 
 * @param melodia Puntero al arreglo de notas (debe terminar con {SILENCIO, 0})
 * 
 * @note Esta función retorna inmediatamente. La melodía sigue tocando en
 *       segundo plano gracias a las interrupciones del timer.
 */
void iniciar_melodia(const Nota *melodia) {
    if (melodia == NULL) return;
    
    // Guardar referencia a la melodía (melodia_actual deja de ser NULL)
    melodia_actual = melodia;
    
    // Empezar desde la primera nota
    indice_nota_actual = 0;
    
    // Marcar el tiempo de inicio para control de duración
    tiempo_inicio_nota = tiempo_transcurrido_ms;
    
    // Configurar y empezar a tocar la primera nota
    // (esto pone reproduciendo = 1 internamente)
    set_frecuencia(melodia[0].frecuencia);
}

/**
 * @brief Detiene la reproducción de la melodía actual
 * 
 * Esta función limpia todas las variables de estado y detiene el audio.
 * 
 * Estado de banderas después de llamar esta función:
 *   melodia_actual = NULL       (indica que no hay melodía activa)
 *   reproduciendo = 0            (set_frecuencia(0) lo desactiva)
 *   indice_nota_actual = 0       (reiniciado)
 */
void detener_melodia(void) {
    // Marcar que no hay melodía activa (melodia_actual se pone a NULL)
    melodia_actual = NULL;
    
    // Reiniciar índice
    indice_nota_actual = 0;
    
    // Detener generación de audio (esto pone reproduciendo = 0)
    set_frecuencia(0);
    
    // Asegurar que el DAC está en 0V
    DAC_UpdateValue(0);
}

/**
 * @brief Actualiza el estado de la melodía (función no bloqueante)
 * 
 * Esta función es el "director de orquesta". Debe llamarse repetidamente en el
 * loop principal del juego para que la melodía avance nota por nota.
 * 
 * Funcionamiento:
 * 1. Verifica si la nota actual ya cumplió su duración
 * 2. Si terminó, hace una pausa corta (30ms) para articulación
 * 3. Avanza a la siguiente nota
 * 4. Detecta si llegó al final de la melodía
 * 
 * Ejemplo de timeline:
 *   t=0ms:    DO_4 empieza (500ms de duración)
 *   t=500ms:  actualizar_melodia() detecta que terminó
 *   t=530ms:  Después de pausa, empieza MI_4
 * 
 * @note DEBE llamarse continuamente en el while(1) del main
 * @note NO bloquea la ejecución - retorna inmediatamente
 */
void actualizar_melodia(void) {
    // Si no hay melodía activa, no hacer nada
    if (melodia_actual == NULL) return;
    
    /* ─────────────────────────────────────────────────────────────────────
     * VERIFICAR DURACIÓN DE LA NOTA ACTUAL
     * ───────────────────────────────────────────────────────────────────── */
    
    uint32_t tiempo_actual = tiempo_transcurrido_ms;
    uint32_t duracion_nota = melodia_actual[indice_nota_actual].duracion;
    uint32_t tiempo_transcurrido_nota = tiempo_actual - tiempo_inicio_nota;
    
    // Verificar si la nota actual ya terminó su duración
    if (tiempo_transcurrido_nota >= duracion_nota) {
        
        /* ─────────────────────────────────────────────────────────────────
         * PAUSA DE ARTICULACIÓN
         * ─────────────────────────────────────────────────────────────────
         * Hacer una pausa breve entre notas para que se escuchen separadas.
         * Sin esta pausa, las notas se "pegarían" y sonarían como un tono
         * continuo que cambia de frecuencia.
         */
        uint32_t tiempo_total_con_pausa = duracion_nota + PAUSA_ARTICULACION_MS;
        
        if (tiempo_transcurrido_nota < tiempo_total_con_pausa) {
            set_frecuencia(0);  // Silencio durante la pausa
            return;
        }
        
        /* ─────────────────────────────────────────────────────────────────
         * AVANZAR A LA SIGUIENTE NOTA
         * ───────────────────────────────────────────────────────────────── */
        
        indice_nota_actual++;
        
        // Verificar si llegamos al final de la melodía
        // (el final está marcado con {SILENCIO, 0})
        if (melodia_actual[indice_nota_actual].frecuencia == SILENCIO && 
            melodia_actual[indice_nota_actual].duracion == 0) {
            // AQUÍ SE CAMBIA melodia_actual a NULL
            detener_melodia();
            return;
        }
        
