dariocastillo11/SNAKE---LPC1769/src/triangular_signal_melodias.c
        // Reproducir la siguiente nota
        // AQUÍ SE CAMBIA reproduciendo según la frecuencia
        set_frecuencia(melodia_actual[indice_nota_actual].frecuencia);
        tiempo_inicio_nota = tiempo_actual;
    }
}

/* ============================== MAIN ====================================== */

/**
 * @brief Programa principal - Reproductor de melodías no bloqueante
 * 
 * Este programa demuestra cómo reproducir melodías musicales en segundo plano
 * usando el DAC y Timer0, sin bloquear la ejecución del programa principal.
 * 
 * Arquitectura:
 * 
 *   ┌─────────────────────────────────────────────────────────────┐
 *   │                    TIMER0_IRQHandler                        │
 *   │  (Interrupciones - generan el sonido en segundo plano)      │
 *   │                                                              │
 *   │  Match 0: Lee TABLA_TRIANGULAR → DAC (cada 20-100μs)       │
 *   │  Match 1: Incrementa tiempo_ms (cada 1ms)                   │
 *   └─────────────────────────────────────────────────────────────┘
 *                              ▲
 *                              │
 *                              │ Genera onda
 *                              │
 *   ┌─────────────────────────────────────────────────────────────┐
 *   │                    while(1) - Main Loop                      │
 *   │  (Loop principal - controla la secuencia de notas)          │
 *   │                                                              │
 *   │  - actualizar_melodia() → cambia frecuencia cuando necesita │
 *   │  - Lógica del juego (Snake, etc.)                           │
 *   │  - Control de pausas entre melodías                         │
 *   └─────────────────────────────────────────────────────────────┘
 * 
 * Flujo de ejecución:
 * 1. Inicialización del hardware (GPIO, DAC, Timer)
 * 2. Iniciar primera melodía
 * 3. Loop infinito:
 *    a. actualizar_melodia() avanza nota si es necesario
 *    b. Lógica del juego (no implementada en este demo)
 *    c. Control de cambio de melodías
 */
int main(void) {
    
    /* ═════════════════════════════════════════════════════════════════════
     * INICIALIZACIÓN DEL HARDWARE
     * ═════════════════════════════════════════════════════════════════════ */
    
    config_GPIO();   // Configurar pines (LED y DAC)
    config_DAC();    // Inicializar convertidor digital-analógico
    config_timer();  // Configurar e iniciar Timer0 (Match 0 y Match 1)

    // Encender LED como indicador de que el sistema está listo
    GPIO_SetPins(PORT_CERO, PIN_22);
    
    /* ═════════════════════════════════════════════════════════════════════
     * VARIABLES DE CONTROL
     * ═════════════════════════════════════════════════════════════════════ */
    
    // Tiempo en que terminó la última melodía (para pausas entre melodías)
    uint32_t tiempo_fin_melodia = 0;
    
    // Índice de la melodía actual (0-3)
    uint8_t melodia_index = 0;
    
    // Flag para detectar transición de reproduciendo → terminada
    uint8_t melodia_terminada = 0;
    
    /* ═════════════════════════════════════════════════════════════════════
     * INICIAR REPRODUCCIÓN
     * ═════════════════════════════════════════════════════════════════════ */
    
    iniciar_melodia(melodia_mario);
    
    /* ═════════════════════════════════════════════════════════════════════
     * LOOP PRINCIPAL - NO BLOQUEANTE
     * ═════════════════════════════════════════════════════════════════════ */
    
    while(1) {
        
        /* ─────────────────────────────────────────────────────────────────
         * 1. ACTUALIZAR MELODÍA EN SEGUNDO PLANO
         * ─────────────────────────────────────────────────────────────────
         * Esta función verifica si la nota actual terminó y avanza a la
         * siguiente si es necesario. Es NO BLOQUEANTE - retorna
         * inmediatamente.
         */
        actualizar_melodia();
        
        /* ─────────────────────────────────────────────────────────────────
         * 2. LÓGICA DEL JUEGO
         * ─────────────────────────────────────────────────────────────────
         * AQUÍ VA EL CÓDIGO DE TU JUEGO (Snake, etc.):
         * 
         * - Leer controles (joystick, botones)
         * - Actualizar posición del personaje
         * - Detectar colisiones
         * - Actualizar pantalla LCD
         * - Calcular puntuación
         * - etc.
         * 
         * Todo esto se ejecuta mientras la música suena en segundo plano.
         */
        
        /* ─────────────────────────────────────────────────────────────────
         * 3. DEMO: ROTACIÓN AUTOMÁTICA DE MELODÍAS
         * ─────────────────────────────────────────────────────────────────
         * Este código demuestra cómo cambiar de melodía automáticamente.
         * En un juego real, cambiarías la melodía según eventos:
         * - Menú principal → melodía 1
         * - Jugando → melodía 2
         * - Game Over → melodía 3
         * - Victoria → melodía 4
         */
        
        // Detectar cuando UNA melodía termina (transición de sonando → silencio)
        if (!esta_reproduciendo() && !melodia_terminada) {
            tiempo_fin_melodia = obtener_tiempo_ms();
            melodia_terminada = 1;
        }
        
        // Esperar 3 segundos después de que terminó, luego iniciar la siguiente
        if (melodia_terminada) {
            uint32_t tiempo_actual = obtener_tiempo_ms();
            uint32_t tiempo_desde_fin = tiempo_actual - tiempo_fin_melodia;
            
            if (tiempo_desde_fin > PAUSA_ENTRE_MELODIAS_MS) {
                // Rotar al siguiente índice (0→1→2→3→0...)
                melodia_index = (melodia_index + 1) % 4;
                
                // Seleccionar e iniciar la melodía correspondiente
                switch(melodia_index) {
                    case 0:
                        iniciar_melodia(melodia_mario);
                        break;
                    case 1:
                        iniciar_melodia(melodia_nokia);
                        break;
                    case 2:
                        iniciar_melodia(melodia_tetris);
                        break;
                    case 3:
                        iniciar_melodia(melodia_happy_birthday);
                        break;
                }
                
                melodia_terminada = 0;  // Reset flag para próxima melodía
            }
        }
        
