dariocastillo11/SNAKE---LPC1769/src/triangular_signal_melodias.c
        __WFI();  // Wait For Interrupt
    }

    return 0;
}

void config_GPIO(){
    PINSEL_CFG_Type pin_configuration;

    // Configurar P0.22 como GPIO (LED)
    pin_configuration.portNum   = PINSEL_PORT_0;
    pin_configuration.pinNum    = PINSEL_PIN_22;
    pin_configuration.pinMode   = PINSEL_PULLUP;
    pin_configuration.funcNum   = PINSEL_FUNC_0;  // GPIO
    pin_configuration.openDrain = PINSEL_OD_NORMAL;

    PINSEL_ConfigPin(&pin_configuration);

    //  Configurar P0.26 como AOUT (salida DAC)
    pin_configuration.portNum   = PINSEL_PORT_0;
    pin_configuration.pinNum    = PINSEL_PIN_26;  // Pin del DAC
    pin_configuration.funcNum   = PINSEL_FUNC_2;  // AOUT función
    pin_configuration.pinMode   = PINSEL_TRISTATE;
    pin_configuration.openDrain = PINSEL_OD_NORMAL;

    PINSEL_ConfigPin(&pin_configuration);

    GPIO_SetDir(PORT_CERO, PIN_22, SALIDA);
    return;
}

void config_DAC(void) {
    DAC_Init();
    // Configurar para máxima velocidad
    DAC_SetBias(0);

    // Valor inicial
    DAC_UpdateValue(0);
}

/**
 * @brief Configura el Timer0 para generación de audio y base de tiempo
 * 
 * Este timer maneja DOS tareas simultáneas usando dos Match Registers con
 * un CONTADOR DE CORRIDA LIBRE (free-running counter).
 * 
 * Match 0 (AUDIO):
 *   - Genera interrupciones a velocidad VARIABLE (según la nota)
 *   - Cada interrupción actualiza un punto de la onda triangular
 *   - Se reconfigura dinámicamente con set_frecuencia()
 *   - NO resetea el contador - usa modo incremental
 *   - Cada IRQ programa el próximo match: MR0 = MR0_anterior + intervalo
 * 
 * Match 1 (TIEMPO):
 *   - Genera interrupciones FIJAS cada 1 milisegundo
 *   - Incrementa contador de tiempo global
 *   - NO resetea el contador - contador corre libre
 *   - Cada IRQ programa el próximo match: MR1 = MR1_anterior + 1000μs
 *   - Sirve para medir duraciones y timing del juego
 * 
 * Prescaler:
 *   - Configurado a 1 microsegundo por tick
 *   - Permite timing preciso para frecuencias de audio
 * 
 * IMPORTANTE - Modo Free-Running:
 *   Ambos matches NO resetean el contador. En su lugar, cada interrupción
 *   calcula el próximo valor de match sumando el intervalo al match actual.
 *   Esto permite que ambos matches coexistan sin interferencia.
 * 
 * Ejemplo de funcionamiento con contador libre:
 *   t=0μs     → TC=0, MR0=60, MR1=1000
 *   t=60μs    → IRQ Match 0 → lee muestra 0, MR0 = 60+60 = 120
 *   t=120μs   → IRQ Match 0 → lee muestra 1, MR0 = 120+60 = 180
 *   t=180μs   → IRQ Match 0 → lee muestra 2, MR0 = 180+60 = 240
 *   ...
 *   t=1000μs  → IRQ Match 1 → tiempo_ms++, MR1 = 1000+1000 = 2000
 *   ...
 *   t=2000μs  → IRQ Match 1 → tiempo_ms++, MR1 = 2000+1000 = 3000
 */
void config_timer(){
    TIM_TIMERCFG_Type cfgtimer;
    TIM_MATCHCFG_Type cfgmatch;

    /* ═════════════════════════════════════════════════════════════════════
     * CONFIGURACIÓN BÁSICA DEL TIMER
     * ═════════════════════════════════════════════════════════════════════ */
    
    // Prescaler: 1 tick = 1 microsegundo
    // Esto permite timing preciso para frecuencias de audio
    cfgtimer.prescaleOption = TIM_USVAL;  // Unidad: microsegundos
    cfgtimer.prescaleValue  = 1;          // 1 microsegundo por tick

    TIM_Init(LPC_TIM0, TIM_TIMER_MODE, &cfgtimer);

    /* ═════════════════════════════════════════════════════════════════════
     * MATCH 0: GENERACIÓN DE AUDIO (velocidad variable)
     * ═════════════════════════════════════════════════════════════════════ */
    
    cfgmatch.matchChannel        = 0;
    cfgmatch.intOnMatch          = ENABLE;     // Generar interrupción
    cfgmatch.resetOnMatch        = DISABLE;    // NO resetear - el contador corre libre
    cfgmatch.stopOnMatch         = DISABLE;    // NO detener timer
    cfgmatch.extMatchOutputType  = TIM_NOTHING;// Sin salida externa
    cfgmatch.matchValue          = 1000;       // Valor inicial (se actualiza después)

    TIM_ConfigMatch(LPC_TIM0, &cfgmatch);
    
    /* ═════════════════════════════════════════════════════════════════════
     * MATCH 1: CONTADOR DE TIEMPO (1ms fijo)
     * ═════════════════════════════════════════════════════════════════════ */
    
    #define MICROSEGUNDOS_POR_MILISEGUNDO  1000
    
    cfgmatch.matchChannel        = 1;
    cfgmatch.intOnMatch          = ENABLE;     // Generar interrupción
    cfgmatch.resetOnMatch        = DISABLE;    // NO resetear - contador libre
    cfgmatch.stopOnMatch         = DISABLE;    // NO detener timer
    cfgmatch.extMatchOutputType  = TIM_NOTHING;// Sin salida externa
    cfgmatch.matchValue          = MICROSEGUNDOS_POR_MILISEGUNDO;  // Primera interrupción a 1ms
    
    TIM_ConfigMatch(LPC_TIM0, &cfgmatch);

    /* ═════════════════════════════════════════════════════════════════════
     * HABILITAR INTERRUPCIONES Y ARRANCAR TIMER
     * ═════════════════════════════════════════════════════════════════════ */
    
    // Habilitar interrupciones del Timer0 en el NVIC
    NVIC_EnableIRQ(TIMER0_IRQn);
    
    // Prioridad 1 (alta, pero no máxima)
    NVIC_SetPriority(TIMER0_IRQn, 1);
    
    // IMPORTANTE: Iniciar el timer (queda corriendo SIEMPRE)
    // El audio se controla con el flag 'reproduciendo', no deteniendo el timer
    TIM_Cmd(LPC_TIM0, ENABLE);

    return;
}